#include "stdafx.h"
#include <stdio.h>
#include <stdlib.h>

int main()
{
	//0.引入
	//0.1 定义时赋值
	int a[10]={1,2,3,4,5,6,7,8,9,10},i;//下标从0开始
	//printf("%d\n",a[0]);//输出a[0]的值
	for(i=0;i<10;i++)
	{
		printf("%d\n",a[i]);//数组元素的引用,循环变量做下标使用
	}

	//0.2 定义后再赋值
	int a[10],i;
	for(i=0;i<10;i++)//给每个元素赋值
	{
		a[i]=i+1;//a[0]=1
	}
	for(i=0;i<10;i++)//输出每个元素
	{
		printf("%d\n",a[i]);//数组元素的引用,循环变量做下标使用
	}

	//0.3 用scanf定义元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++)//输出每个元素
	{
		printf("%d\n",a[i]);//数组元素的引用,循环变量做下标使用
	}

	//1.创建一个长度是10的数组,初始值为1-10,输出所有元素
	int a[10]={1,2,3,4,5,6,7,8,9,10},i;
	for(i=0;i<10;i++)//输出每个元素
	{
		printf("%d\n",a[i]);//数组元素的引用,循环变量做下标使用
	}


	//2.创建一个长度是10的数组,初始值为1-10,输出所有奇数元素
	int a[10]={1,2,3,4,5,6,7,8,9,10},i;
	for(i=0;i<10;i++)
	{
		if(a[i]%2==1)
		{
			printf("%d\n",a[i]);
		}
	}


	//3.创建一个长度是10的数组,初始值为1-10,输出所有偶数元素
	int a[10]={1,2,3,4,5,6,7,8,9,10},i;
	for(i=0;i<10;i++)
	{
		if(a[i]%2==0)
		{
			printf("%d\n",a[i]);
		}
	}


	//4.创建一个长度是10的数组,初始值为1-10,输出所有元素的和
	int a[10]={1,2,3,4,5,6,7,8,9,10},i,sum=0;
	for(i=0;i<10;i++)
	{
		sum += a[i];
	}
	printf("%d个数的总和为:%d\n",i,sum);


	//5.创建一个长度是10的数组,初始值为1-10,输出所有偶数元素的和
	int a[10]={1,2,3,4,5,6,7,8,9,10},i,sum=0;
	for(i=0;i<10;i++)
	{
		if(a[i]%2==0)
		{
			sum += a[i];
		}
	}
	printf("%d个数中偶数的总和为:%d\n",i,sum);


	//6.创建一个长度是10的数组,初始值为1-10,输出所有奇数元素的和
	int a[10]={1,2,3,4,5,6,7,8,9,10},i,sum=0;
	for(i=0;i<10;i++)
	{
		if(a[i]%2==1)
		{
			sum += a[i];
		}
	}
	printf("%d个数中奇数的总和为:%d\n",i,sum);


	//7.创建一个长度是10的数组,元素赋值1-10,输出所有元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		a[i]=i+1;
	}
	for(i=0;i<10;i++)
	{
		printf("%d\n",a[i]);
	}


	//8.创建一个长度是10的数组,元素赋值1-10,输出所有偶数元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		a[i]=i+1;
	}
	for(i=0;i<10;i++)
	{
		if(a[i]%2==0)
		{
			printf("%d\n",a[i]);
		}
	}


	//9.创建一个长度是10的数组,元素赋值1-10,输出所有奇数元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		a[i]=i+1;
	}
	for(i=0;i<10;i++)
	{
		if(a[i]%2==1)
		{
			printf("%d\n",a[i]);
		}
	}


	//10.创建一个长度是10的数组,元素赋值1-10,所有元素求和
	int a[10],i,sum=0;
	for(i=0;i<10;i++)
	{
		a[i]=i+1;
	}
	for(i=0;i<10;i++)
	{
		sum += a[i];
	}
	printf("%d个数的总和为:%d\n",i,sum);


	//11.创建一个长度是10的数组,元素值由键盘输入,输出所有元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++)
	{
		printf("%d\n",a[i]);
	}


	//12.创建一个长度是10的数组,元素值由键盘输入,输出所有偶数元素
	int a[10],i;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++)
	{
		if(a[i]%2==0)
		{
			printf("%d\n",a[i]);
		}
	}


	//13.创建一个长度是10的数组,元素值由键盘输入,输出所有元素和
	int a[10],i,sum=0;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++)
	{
		sum += a[i];
	}
	printf("%d个数的总和为:%d\n",i,sum);


	//14.创建一个长度是10的数组,初始值为1-10,判断用户输入的n是否存在于数组当中
	int a[10]={1,2,3,4,5,6,7,8,9,10},i,x;
	printf("请输入一个数:");
	scanf("%d",&x);
	for(i=0;i<10;i++)//11
	{
		if(a[i]==x)
		{
			printf("\"%d\"存在数组中\n",x);
		}
	}
	//printf("i=%d\n",i);//调试项
	if(i==10)
	{
		printf("\"%d\"不存在数组中\n",x);
	}


	//15.从键盘输入十个数并逆序输出
	int a[10],i;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=9;i>=0;i--)
	{
		printf("%d\n",a[i]);
	}


	//16.从键盘输入十个数,输出其中最大数
	int a[10],i,max;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	max=a[0];
	for(i=0;i<10;i++)
	{
		if(max<a[i])
		{
			max = a[i];
		}
	}
	printf("最大值为:%d\n",max);


	//17.从键盘输入十个数,输出其中最小数
	int a[10],i,min;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	min=a[0];
	for(i=1;i<10;i++)
	{
		if(min>a[i])
		{
			min = a[i];
		}
	}
	printf("最小值为:%d\n",min);


	//18.从键盘输入十个数,输出其中大于3的数
	int a[10],i;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++)
	{
		if(a[i]>3)
		{
			printf("%d\n",a[i]);
		}
	}


	//19.从键盘输入十个数,并将其中的最大数和最小数交换
	int a[10],i,max,min,x;
	for(i=0;i<10;i++)
	{
		printf("请输入第%d个数:",i+1);
		scanf("%d",&a[i]);
	}
	max=min=a[0];
	for(i=1;i<10;i++)//求最大值
	{
		if(max<a[i])
		{
			max = a[i];
		}
	}
	for(i=1;i<10;i++)//求最小值
	{
		if(min>a[i])
		{
			min = a[i];
		}
	}
	printf("最大值(max)为:%d,最小值(min)为:%d\n",max,min);
	x = max;
	max = min;
	min = x;
	printf("改变后的最大值(min)为:%d,最小值(max)为:%d\n",min,max);


	//20.创建一个长度是10的数组,初始值为1-10,输出元素6的下标
	int a[10]={1,2,3,4,5,6,7,8,9,10},i;
	for(i=0;i<10;i++)
	{
		if(a[i]==6)
		{
			printf("元素6 = a[%d]\n",i);
		}
	}

	
	system("pause");
}