<%--
  Created by IntelliJ IDEA.
  User: Administrator
  Date: 2022/9/9
  Time: 11:24
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>院系设置</title>
</head>
<body>
    <div class="text">
        <pre>
            C
            材料学院
            出土文献研究与保护中心

            D
            低碳能源实验室
            电机工程与应用电子技术系

            F
            法学院

            G
            高等研究院
            工程物理系
            公共管理学院
            国际与地区研究院

            H
            航空发动机研究院
            航天航空学院

            工程力学系
            航空宇航工程系
            核能与新能源技术研究院
            化学工程系
            环境学院

            环境工程系
            环境科学系
            环境规划与管理系

            J
            * 机械工程学院 *

            机械工程系
            精密仪器系
            能源与动力工程系
            车辆与运载学院
            工业工程系
            基础工业训练中心
            建筑学院

            建筑系
            城市规划系
            建筑技术科学系
            景观学系
            交叉信息研究院
            教育研究院
            经济管理学院

            会计系
            经济系
            金融系
            创新创业与战略系
            领导力与组织管理系
            管理科学与工程系
            市场营销系

            L
            * 理学院 *

            数学科学系
            物理系
            化学系
            地球系统科学系
            天文系

            M
            马克思主义学院
            美术学院

            艺术史论系
            工业设计系
            环境艺术设计系
            陶瓷艺术设计系
            视觉传达设计系
            染织服装艺术设计系
            信息艺术设计系
            工艺美术系
            绘画系
            雕塑系

            N
            脑与智能实验室

            Q
            全球创新学院
            求真书院

            R
            人文学院

            中国语言文学系
            外国语言文学系
            历史系
            科学史系
            哲学系
            日新书院

            S
            社会科学学院

            社会学系
            政治学系
            国际关系学系
            心理学系
            经济学研究所
            深圳国际研究生院
            生命科学学院
            生物医学交叉研究院
            数学科学中心
            苏世民书院

            T
            体育部
            土木水利学院

            土木工程系
            水利水电工程系
            建设管理系
            探微书院
            碳中和研究所

            W
            万科公共卫生与健康学院
            未来实验室
            五道口金融学院
            未央书院
            为先书院

            X
            新闻与传播学院
            新雅书院
            * 信息科学技术学院 *

            电子工程系
            计算机科学与技术系
            自动化系
            集成电路学院
            网络科学与网络空间研究院
            软件学院
            信息国家研究中心
            行健书院

            Y
            药学院
            医学院

            生物医学工程系
            基础医学系
            临床医学院
            艺术教育中心
            语言教学中心

            Z
            智能产业研究院
            致理书院

            注：* 为非实体学院
        </pre>
    </div>
</body>
</html>
